//
// base.h
//
// This is a public domain C++ library.
// No warranty implied, use at your own risk!
//
// This library contains things that I wish C provided by default.
// Those things are basic data structures (arrays, strings, hash tables).
// The first time I tried C, I liked how simple it is. It's so simple
// that it tastes bland and raw, so I want to add some flavors to
// satisfy my tongue.
//
// You can find most of the things this library has in the C++
// standard template library (STL). But if you're just like me, if you
// want to use C with a little bit of flavors--templates,
// overloading--if you want to keep everything explicit init-and-free
// (no RAII), maybe this library will be helpful for you (hopefully).
//
//
// IMPORTANT
//
// Do this:
//
//   #define BASE_IMPLEMENTATION
//
// in ONE C++ file before including this library.
//
// It should look like this:
//
//   #define BASE_IMPLEMENTATION
//   #include "base.h"
//
//
// EXAMPLE USAGE
//
//   Arenas
//
//     Create an arena with reserve size of n bytes and commit size of m bytes:
//       Arena *arena = arena_create(n, m);
//
//     Push n bytes onto the arena:
//       void *ptr = arena_push(arena, n);
//
//     Push one sizeof(T) bytes onto the arena:
//       void *ptr = PUSH_ONE(arena, T);
//
//     Push n sizeof(T) bytes onto the arena:
//       void *ptr = PUSH_MANY(arena, T, n);
//
//     Clear the arena:
//       arena_clear(arena);
//

//
//     Get capacity of the array:
//       nums.cap
//
//     Free the array:
//       array_free(&nums);
//
//   Strings
//
//     Make a string with LIT(s):
//       String text = LIT("Foo");
//
//     Access the i'th byte in the string:
//       text[i]
//
//     Get length of the string:
//       text.len
//
//     Compare two strings:
//       text == "Foo"
//       text == LIT("Foo")
//
//     Printf-style arguments:
//       printf("%.*s", FMT(text));
//
//     Concatenate two strings (needs arena for allocation):
//       String new_text = string_concat(arena, text, LIT("Bar"));
//
//     Convert to C string (needs arena for allocation):
//       const char *cstr = string_to_cstr(arena, text);
//
//   Hash Tables
//
//     Init a hash table of type Table<String, int>:
//       Table<String, int> height;
//       table_init(&height);
//
//     Set an item to the hash table:
//       table_set(&height, LIT("Asep"), 192);
//       table_set(&height, LIT("Udin"), 210);
//
//     Get an item from the hash table:
//       int *x = table_get(&height, LIT("Asep"));
//
//     Free the table:
//       table_free(&height);
// 

#ifndef BASE_H
#define BASE_H

//
// DECLARATION
//

#ifdef BASE_IMPLEMENTATION
    #define BASE_DEF
#else
    #define BASE_DEF extern
#endif

#define local_persist static // Local persisting variable
#define internal      static // Internal linkage
#define global_var    static // Global variable

// OS detection

#if defined(_WIN32) || defined(_WIN64)
    #define OS_WINDOWS 1
#else
    #define OS_WINDOWS 0
#endif

#if defined(__linux__)
    #define OS_LINUX 1
#else
    #define OS_LINUX 0
#endif

#if defined(__APPLE__) && defined(__MACH__)
    #define OS_MAC 1
#else
    #define OS_MAC 0
#endif

#if !OS_WINDOWS && !OS_LINUX && !OS_MAC
    #error "Unsupported OS"
#endif

// Compiler detection

#if defined(_MSC_VER)
    #define COMPILER_MSVC 1
#else
    #define COMPILER_MSVC 0
#endif

#if defined(__clang__)
    #define COMPILER_CLANG 1
#else
    #define COMPILER_CLANG 0
#endif

#if defined(__GNUC__) && !COMPILER_CLANG
    #define COMPILER_GCC 1
#else
    #define COMPILER_GCC 0
#endif

// Compiler hints

#if COMPILER_MSVC
    #define FORCE_INLINE    __forceinline
    #define NO_INLINE       __declspec(noinline)
    #define LIKELY(x)       (x)
    #define UNLIKELY(x)     (x)
#elif COMPILER_CLANG || COMPILER_GCC
    #define FORCE_INLINE    __attribute__((always_inline)) inline
    #define NO_INLINE       __attribute__((noinline))
    #define LIKELY(x)       __builtin_expect(!!(x), 1)
    #define UNLIKELY(x)     __builtin_expect(!!(x), 0)
#else
    #define FORCE_INLINE    inline
    #define NO_INLINE
    #define LIKELY(x)       (x)
    #define UNLIKELY(x)     (x)
#endif

#define UNUSED(x)       ((void)(x))
#define FALLTHROUGH     [[fallthrough]]
#define DEPRECATED(msg) [[deprecated(msg)]]

// Example: struct PACKED MyStruct { ... };
#if COMPILER_MSVC
    #define PACKED __pragma(pack(push, 1)) /* struct */ __pragma(pack(pop))
#elif COMPILER_CLANG || COMPILER_GCC
    #define PACKED __attribute__((packed))
#endif

#if COMPILER_MSVC
    #define THREAD_LOCAL __declspec(thread)
#elif COMPILER_CLANG || COMPILER_GCC
    #define THREAD_LOCAL __thread
#else
    #error "No thread-local storage support for this compiler"
#endif

// Basic types

#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>

typedef uint8_t  u8;
typedef uint16_t u16;
typedef uint32_t u32;
typedef uint64_t u64;

typedef int8_t  i8;
typedef int16_t i16;
typedef int32_t i32;
typedef int64_t i64;

typedef float  f32;
typedef double f64;

typedef size_t usize;
typedef ptrdiff_t isize;

#define U8_MAX  0xFF
#define U16_MAX 0xFFFF
#define U32_MAX 0xFFFFFFFFu
#define U64_MAX 0xFFFFFFFFFFFFFFFFull

#define I8_MIN  ((i8) 0x80)
#define I8_MAX  ((i8) 0x7F)
#define I16_MIN ((i16)0x8000)
#define I16_MAX ((i16)0x7FFF)
#define I32_MIN ((i32)0x80000000)
#define I32_MAX ((i32)0x7FFFFFFF)
#define I64_MIN ((i64)0x8000000000000000)
#define I64_MAX ((i64)0x7FFFFFFFFFFFFFFF)

#define F32_MIN     (1.17549435e-38f)
#define F32_MAX     (3.40282347e+38f)
#define F32_EPSILON (1.19209290e-07f)
#define F64_MIN     (2.2250738585072014e-308)
#define F64_MAX     (1.7976931348623157e+308)
#define F64_EPSILON (2.2204460492503131e-16)

// Bit manipulation

#define BIT(n)            (1ULL << (n))
#define BIT_SET(x, n)     ((x) |=  BIT(n))
#define BIT_CLEAR(x, n)   ((x) &= ~BIT(n))
#define BIT_TOGGLE(x, n)  ((x) ^=  BIT(n))
#define BIT_CHECK(x, n)   (((x) >> (n)) & 1)

#define KiB(n) ((u64)(n) << 10)
#define MiB(n) ((u64)(n) << 20)
#define GiB(n) ((u64)(n) << 30)

// Packs 4 chars into a u32, useful for file format magic numbers/tags.
// Example: u32 png_tag = FOURCC('P','N','G',' ');
#define FOURCC(a, b, c, d)\
    ((u32)(a) | ((u32)(b) << 8) | ((u32)(c) << 16) | ((u32)(d) << 24))

// Math helpers

#define ARRAY_COUNT(x) (sizeof(x) / sizeof((x)[0]))

#define ALIGN_UP(x, a) (((x) + ((a)-1)) & ~((a)-1))
#define ALIGN_DOWN(x, a) ((x) & ~((a)-1))

#define MIN(a,b) ((a) < (b) ? (a) : (b))
#define MAX(a,b) ((a) > (b) ? (a) : (b))
#define CLAMP(x, lo, hi) (MAX((lo), MIN((x), (hi))))

#define ABS(x)        ((x) < 0 ? -(x) : (x))
#define SIGN(x)       ((x) > 0 ? 1 : ((x) < 0 ? -1 : 0))
#define SQUARE(x)     ((x) * (x))
#define IS_POW2(x)    ((x) != 0 && ((x) & ((x) - 1)) == 0)
#define LERP(a, b, t) ((a) + ((b) - (a)) * (t))

// Asserts

#if COMPILER_MSVC
    #define DEBUG_BREAK() __debugbreak()
#else
    #define DEBUG_BREAK() __builtin_trap()
#endif

#ifndef _DEBUG
    #define ASSERT(x) do { if (!(x)) DEBUG_BREAK(); } while(0)
#else
    #define ASSERT(x)
#endif

#define STATIC_ASSERT(cond, msg) static_assert(cond, msg)

STATIC_ASSERT(sizeof(i8)  == 1, "i8 size incorrect");
STATIC_ASSERT(sizeof(i16) == 2, "i16 size incorrect");
STATIC_ASSERT(sizeof(i32) == 4, "i32 size incorrect");
STATIC_ASSERT(sizeof(i64) == 8, "i64 size incorrect");

STATIC_ASSERT(sizeof(u8)  == 1, "u8 size incorrect");
STATIC_ASSERT(sizeof(u16) == 2, "u16 size incorrect");
STATIC_ASSERT(sizeof(u32) == 4, "u32 size incorrect");
STATIC_ASSERT(sizeof(u64) == 8, "u64 size incorrect");

// Stringify / concat

#define STRINGIFY_INNER(x) #x
#define STRINGIFY(x)       STRINGIFY_INNER(x)

#define CONCAT_INNER(a, b) a##b
#define CONCAT(a, b)       CONCAT_INNER(a, b)

// Scope-based defer
// From: https://github.com/gingerBill/gb/blob/master/gb.h

template <typename T> struct gbRemoveReference       { typedef T Type; };
template <typename T> struct gbRemoveReference<T &>  { typedef T Type; };
template <typename T> struct gbRemoveReference<T &&> { typedef T Type; };

template <typename T> inline T &&gb_forward(typename gbRemoveReference<T>::Type &t)  { return static_cast<T &&>(t); }
template <typename T> inline T &&gb_forward(typename gbRemoveReference<T>::Type &&t) { return static_cast<T &&>(t); }
template <typename T> inline T &&gb_move   (T &&t)                                   { return static_cast<typename gbRemoveReference<T>::Type &&>(t); }
template <typename F>
struct gbprivDefer {
    F f;
